In [1]:
import requests as r
import json
import pandas as pd
from many_requests import ManyRequests
import numpy as np
import csv

In [2]:
path_ratings = "./created/relevant_ratings_comp.csv"

In [3]:
df = pd.read_csv(path_ratings)
df.head()

   user_id  movie_id  rating
0        1       307     3.5
1        1       481     3.5
2        1      1091     1.5
3        1      1257     4.5
4        1      1449     4.5

In [5]:
print("nb ratings : ", len(df))

nb ratings :  27614759

In [11]:
nb_users = len(df["user_id"].unique())
print("nb_users : ", nb_users)

nb_users :  283144

In [28]:
serie_nb_ratings = df.groupby(["user_id"]).size()
df_nb_ratings = pd.DataFrame()
df_nb_ratings["nb_ratings"] = serie_nb_ratings
df_nb_ratings

         nb_ratings
user_id
1                16
2                15
3                11
4               732
5                72
...             ...
283224          329
283225           20
283226           11
283227           17
283228          113

[283144 rows x 1 columns]

In [34]:
df_nb_ratings[df_nb_ratings["nb_ratings"] > 70].sum()

nb_ratings    23029071
dtype: int64

In [47]:
keepers = df_nb_ratings[df_nb_ratings["nb_ratings"] <= 70]
keepers

         nb_ratings
user_id
1                16
2                15
3                11
6                42
7                15
...             ...
283222           69
283223            6
283225           20
283226           11
283227           17

[196201 rows x 1 columns]

In [43]:
keepers_np = np.array(keepers.index)

In [44]:
kept_ratings = df[df["user_id"].isin(keepers_np)]

In [45]:
kept_ratings

          user_id  movie_id  rating
0               1       307     3.5
1               1       481     3.5
2               1      1091     1.5
3               1      1257     4.5
4               1      1449     4.5
...           ...       ...     ...
27614641   283227      3006     5.0
27614642   283227      3256     5.0
27614643   283227      4002     4.5
27614644   283227      4321     4.5
27614645   283227     96110     4.0

[4585688 rows x 3 columns]

In [48]:
kept_ratings.to_csv("./created/ratings_small.csv")